artillery_aws.yml
# /content/:id
config:
  name: '/content/:id'
  target: "http://ec2-54-202-55-80.us-west-2.compute.amazonaws.com:4000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 30
    - duration: 120
      arrivalRate: 30
  payload:
    path: "id_mil.csv"
    fields:
      - "id"
    # order: "sequence"
scenarios:
  - flow:
    - loop:
      - get:
          url: "/content/{{ id }}"
      count: 75
      think: 0.5

# /home
# config:
#   name: '/home'
#   target: "http://localhost:1337"
#   phases:
#     - duration: 10
#       arrivalRate: 10 D
#       rampTo: 30
#     - duration: 20
#       arrivalRate: 30
# scenarios:
#   - flow:
#     - loop:
#       - get:
#           url: "/home"
#       count: 200
#       think: 1